Akustik13/beacon-30mhz/TX_Beacon/STM32_WPAN/App/app_ble.c
#include "app_ble.h"
#include "app_common.h"
#include "ble_common.h"
#include "ble_hal_aci.h"
#include "ble_gap_aci.h"
#include "ble_gatt_aci.h"
#include "ble_hci_le.h"
#include "ble_legacy.h"
#include "hci_tl.h"
#include "shci_tl.h"
#include "shci.h"
#include "tl.h"
#include "svc_ctl.h"
#include "stm32_seq.h"
#include "otp.h"
#include "hw.h"
#include "ble_beacon_service.h"
#include "ble_nus_service.h"
#include "drv_led.h"
#include "drv_uart.h"
#include "stm32wbxx_hal.h"
#include "stm32wbxx_ll_system.h"
#include "stm32wbxx_ll_ipcc.h"
#include "stm32wbxx_ll_exti.h"
#include <string.h>

/* ── BLE state ───────────────────────────────────────────────────────────── */
typedef enum {
    BLE_ST_IDLE    = 0,
    BLE_ST_ADV     = 1,
    BLE_ST_CONN    = 2,
} BleState_t;

static volatile BleState_t s_ble_state          = BLE_ST_IDLE;
static volatile uint8_t    s_cpu2_ready         = 0U;
static volatile uint8_t    s_waiting_cpu2_ready  = 0U;
static volatile uint8_t    s_shci_evt_pending    = 0U;
static volatile uint8_t    s_hci_evt_pending     = 0U;
static volatile uint32_t   s_hci_notify_count    = 0U;
static volatile uint32_t   s_hci_process_count   = 0U;
static uint16_t            s_conn_handle = 0xFFFFU;
static uint32_t            s_uid_low     = 0U;
/* ACI advertising local-name field: first byte is the AD type, followed by
 * the visible device name bytes. */
static uint8_t             s_adv_local_name[1U + CFG_GAP_DEVICE_NAME_LENGTH];

/* ── Session management (Task 2) ─────────────────────────────────────────── */
static uint8_t  s_session_active      = 0U;
static uint8_t  s_session_is_timed    = 0U;
static uint32_t s_session_timeout_ms  = 0U;
static uint32_t s_session_start_tick  = 0U;
/* Set after first successful BLE_AppInit(); cleared only by BLE_ForceShutdown().
 * When 1, BLE_StartSession() skips full re-init and just restarts advertising.
 * Needed because once C2BOOT is set, a clear/set has no effect (hw_ipcc.c:210),
 * so TL_Enable() cannot reboot CPU2 for a second session. */
static uint8_t  s_cpu2_initialized   = 0U;

/* ── BLE LED state machine (independent from main LED driver) ────────────── */
static uint32_t s_adv_blink_tick  = 0U;
static uint8_t  s_adv_blink_phase = 0U;  /* 0=waiting, 1=pulse on */

/* ── NUS inactivity timeout (Bug 1: stale session guard) ─────────────────── */
/* Reset on connection + each NUS RX write. If connected and no NUS data for
 * BLE_NUS_IDLE_TIMEOUT_MS, we force-disconnect — PC app failed to subscribe. */
#define BLE_NUS_IDLE_TIMEOUT_MS  60000U   /* 60 s — covers any init latency */
static volatile uint32_t s_nus_last_rx_tick = 0U;

void BLE_NusMarkActivity(void) { s_nus_last_rx_tick = HAL_GetTick(); }

/* ── BLE runtime settings (Task 5) — loaded from flash via flash_config.c ── */
uint8_t  g_ble_op_mode          = BLE_OP_CONTINUOUS;
uint8_t  g_ble_tx_power         = CFG_TX_POWER;
uint16_t g_ble_interval_s       = 1800U; /* schedule mode: seconds between windows */
uint16_t g_ble_duration_sec     = 60U;   /* session window (s) for schedule/gekon  */
uint16_t g_ble_adv_interval_ms  = 1000U; /* advertising interval (ms)              */
uint8_t  g_ble_name_mode        = 0U;    /* 0=auto "BCN_XXXX", 1=manual g_ble_name */
char     g_ble_name[12]         = {0};   /* manual device name (null-terminated)   */
uint8_t  g_ble_led_mode         = BLE_LED_NORMAL;

/* ── Shared-memory buffers (placed in MB_MEM sections in RAM_SHARED) ─────── */
#define POOL_SIZE  (CFG_TLBLE_EVT_QUEUE_LENGTH * 4U * \
                    DIVC((sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE), 4U))

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t s_BleCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        s_SysSpareEvtBuf[sizeof(TL_PacketHeader_t)
                                                                              + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t s_ShciCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        s_BleSpareEvtBuf[sizeof(TL_PacketHeader_t)
                                                                              + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t        s_EvtPool[POOL_SIZE];

/* ── Forward declarations ────────────────────────────────────────────────── */
static void _SysEvtHandler(void *pPayload);
static void _SysStatusNot(SHCI_TL_CmdStatus_t status);
static void _BleUserEvtRx(void *pPayload);
static void _BleStatusNot(HCI_TL_CmdStatus_t status);
static void _HandleConnectionEvent(void *pPayload);
static void _GapGattInit(void);
static void _StartAdvertising(void);
static void _BleGetBdAddress(uint8_t *pbd_addr);
static void _StopSession_internal(void);

/* ── Public API ──────────────────────────────────────────────────────────── */

uint8_t  BLE_IsIdle(void)        { return (s_ble_state == BLE_ST_IDLE) ? 1U : 0U; }
uint8_t  BLE_IsConnected(void)   { return (s_ble_state == BLE_ST_CONN) ? 1U : 0U; }
uint8_t  BLE_IsAdvertising(void) { return (s_ble_state == BLE_ST_ADV)  ? 1U : 0U; }
uint16_t BLE_GetConnHandle(void) { return s_conn_handle; }

void BLE_ProcessEvents(void)
{
    /* Normally the IPCC IRQ dispatches this. Polling the unmasked RX flags as
     * a fallback also makes event handling robust across Stop-mode wake-up. */
    uint32_t rx_pending = IPCC->C2TOC1SR & ~IPCC->C1MR & 0x3FU;
    if (rx_pending != 0U) {
        HW_IPCC_Rx_Handler();
    }

    /* Process transport queues directly — avoids UTIL_SEQ blocking issue that
     * prevented HCI events from being dispatched in this standalone integration. */
    while (s_shci_evt_pending != 0U) {
        s_shci_evt_pending = 0U;
        shci_user_evt_proc();
    }
    while (s_hci_evt_pending != 0U) {
        s_hci_evt_pending = 0U;
        s_hci_process_count++;
        hci_user_evt_proc();
    }

    /* Session timeout: stop advertising if window expired (schedule/gekon modes) */
    if (s_session_is_timed && s_session_active && (s_ble_state == BLE_ST_ADV)) {
        if ((HAL_GetTick() - s_session_start_tick) >= s_session_timeout_ms) {
            UART_Print("[BLE] Session timeout — stopping.\r\n");
            _StopSession_internal();
        }
    }

    /* NUS inactivity guard: PC connected but never subscribed NUS or crashed.
     * Without this the beacon hangs in BLE_ST_CONN with no data flowing. */
    if (s_ble_state == BLE_ST_CONN) {
        if ((HAL_GetTick() - s_nus_last_rx_tick) >= BLE_NUS_IDLE_TIMEOUT_MS) {
            UART_Print("[BLE] NUS idle timeout — dropping stale client\r\n");
            aci_gap_terminate(s_conn_handle, 0x13U); /* 0x13=RemoteUserTerminatedConn */
            s_nus_last_rx_tick = HAL_GetTick();   /* prevent rapid re-fires */
        }
    }
}

/* Clear all IPCC flags that survive NRST. Without this, CPU2 sees a stale
 * command from the previous run (C1TOC2SR != 0) and hangs before SHCI_READY. */
void BLE_SystemPreInit(void)
{
    LL_AHB3_GRP1_EnableClock(LL_AHB3_GRP1_PERIPH_IPCC);

    LL_C1_IPCC_ClearFlag_CHx(IPCC,
        LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 |
        LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);
    LL_C2_IPCC_ClearFlag_CHx(IPCC,
        LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 |
        LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);
    LL_C1_IPCC_DisableTransmitChannel(IPCC,
        LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 |
        LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);
    LL_C2_IPCC_DisableTransmitChannel(IPCC,
        LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 |
        LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);
    LL_C1_IPCC_DisableReceiveChannel(IPCC,
        LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 |
        LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);
    LL_C2_IPCC_DisableReceiveChannel(IPCC,
        LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 |
        LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);
}

/* ── BLE_AppInit: full stack bring-up, blocks until CPU2 ready (≤10 s) ───── */
void BLE_AppInit(void)
{
    /* Enable IPCC (EXTI36) and HSEM (EXTI38) wakeup lines so Stop mode is
     * exited when CPU2 sends events or acquires HSEM semaphores */
    LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_36 | LL_EXTI_LINE_38);

    UART_Print("[BLE] AppInit: registering tasks...\r\n");

