Akustik13/beacon-30mhz/TX_Beacon/STM32_WPAN/App/app_ble.c
    /* ── Register sequencer tasks ─────────────────────────────────────────── */
    UTIL_SEQ_RegTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID,
                     UTIL_SEQ_RFU, hci_user_evt_proc);
    UTIL_SEQ_RegTask(1U << CFG_TASK_SYSTEM_HCI_ASYNCH_EVT_ID,
                     UTIL_SEQ_RFU, shci_user_evt_proc);

    /* ── Init IPCC hardware ───────────────────────────────────────────────── */
    UART_Print("[BLE] IPCC init...\r\n");
    HW_IPCC_Init();

    /* ── Init transport layer reference table ─────────────────────────────── */
    UART_Print("[BLE] TL init...\r\n");
    TL_Init();

    /* ── Init SHCI (system control channel to CPU2) ───────────────────────── */
    UART_Print("[BLE] SHCI init...\r\n");
    SHCI_TL_HciInitConf_t shci_cfg;
    shci_cfg.p_cmdbuffer       = (uint8_t*)&s_ShciCmdBuffer;
    shci_cfg.StatusNotCallBack = _SysStatusNot;
    shci_init(_SysEvtHandler, (void*)&shci_cfg);

    /* ── Init memory manager ──────────────────────────────────────────────── */
    UART_Print("[BLE] MM init...\r\n");
    TL_MM_Config_t mm_cfg;
    mm_cfg.p_BleSpareEvtBuffer    = s_BleSpareEvtBuf;
    mm_cfg.p_SystemSpareEvtBuffer = s_SysSpareEvtBuf;
    mm_cfg.p_AsynchEvtPool        = s_EvtPool;
    mm_cfg.AsynchEvtPoolSize      = sizeof(s_EvtPool);
    TL_MM_Init(&mm_cfg);

    /* ── Enable TL (boots CPU2) ───────────────────────────────────────────── */
    LL_C2_PWR_SetPowerMode(LL_PWR_MODE_SHUTDOWN);
    s_cpu2_ready = 0U;
    s_waiting_cpu2_ready = 1U;
    UART_Print("[BLE] TL_Enable (booting CPU2)...\r\n");
    TL_Enable();
    UART_Printf("[BLE] After TL_Enable: CR4=%08lX C2BOOT=%lu SR2=%08lX "
                "C1TOC2SR=%08lX C2TOC1SR=%08lX C1MR=%08lX\r\n",
                (unsigned long)PWR->CR4,
                (PWR->CR4 & PWR_CR4_C2BOOT) ? 1UL : 0UL,
                (unsigned long)PWR->SR2,
                (unsigned long)IPCC->C1TOC2SR,
                (unsigned long)IPCC->C2TOC1SR,
                (unsigned long)IPCC->C1MR);

    /* ── Wait for SHCI_READY from CPU2 (≤10 s) ──────────────────────────── */
    UART_Print("[BLE] Waiting for CPU2 READY...\r\n");
    extern volatile uint32_t g_ipcc_rx_irq_cnt;
    uint32_t t0 = HAL_GetTick();
    uint32_t last_diag = t0;
    while (!s_cpu2_ready) {
        /* Drain SHCI event directly — UTIL_SEQ_Run() blocks here in this
         * integration; direct flag polling avoids the deadlock. */
        if (s_shci_evt_pending != 0U) {
            s_shci_evt_pending = 0U;
            shci_user_evt_proc();
        }

        uint32_t now = HAL_GetTick();
        if ((now - last_diag) >= 500U) {
            last_diag = now;
            UART_Printf("[BLE] t=%lums CR4=%08lX C2BOOT=%lu SR2=%08lX "
                        "C1TOC2SR=%08lX C2TOC1SR=%08lX C1MR=%08lX IRQcnt=%lu\r\n",
                        (unsigned long)(now - t0),
                        (unsigned long)PWR->CR4,
                        (PWR->CR4 & PWR_CR4_C2BOOT) ? 1UL : 0UL,
                        (unsigned long)PWR->SR2,
                        (unsigned long)IPCC->C1TOC2SR,
                        (unsigned long)IPCC->C2TOC1SR,
                        (unsigned long)IPCC->C1MR,
                        (unsigned long)g_ipcc_rx_irq_cnt);
        }
        if ((now - t0) > 10000U) {
            UART_Printf("[BLE] ERROR: CPU2 not ready in 10s. IRQcnt=%lu\r\n",
                        (unsigned long)g_ipcc_rx_irq_cnt);
            s_waiting_cpu2_ready = 0U;
            return;
        }
    }
    s_waiting_cpu2_ready = 0U;
    UART_Print("[BLE] CPU2 READY received.\r\n");

    /* ── Init HCI transport BEFORE asking CPU2 to init BLE stack ────────────
     * ST's APP_BLE_Init() does Ble_Tl_Init() before SHCI_C2_BLE_Init().
     * The BLE event/command channels must be ready first. */
    UART_Print("[BLE] HCI transport init...\r\n");
    HCI_TL_HciInitConf_t hci_cfg;
    hci_cfg.p_cmdbuffer       = (uint8_t*)&s_BleCmdBuffer;
    hci_cfg.StatusNotCallBack = _BleStatusNot;
    hci_init(_BleUserEvtRx, (void*)&hci_cfg);
    UART_Printf("[BLE] HCI ready: C1MR=%08lX\r\n", (unsigned long)IPCC->C1MR);

    /* ── Init BLE stack on CPU2 ───────────────────────────────────────────── */
    SHCI_C2_Ble_Init_Cmd_Packet_t ble_init = {
        {{0, 0, 0}},
        {
            0U,                                 /* BleBufferAddress (auto) */
            0U,                                 /* BleBufferSize    (auto) */
            CFG_BLE_NUM_GATT_ATTRIBUTES,
            CFG_BLE_NUM_GATT_SERVICES,
            CFG_BLE_ATT_VALUE_ARRAY_SIZE,
            CFG_BLE_NUM_LINK,
            CFG_BLE_DATA_LENGTH_EXTENSION,
            CFG_BLE_PREPARE_WRITE_LIST_SIZE,
            CFG_BLE_MBLOCK_COUNT,
            CFG_BLE_MAX_ATT_MTU,
            CFG_BLE_PERIPHERAL_SCA,
            CFG_BLE_CENTRAL_SCA,
            CFG_BLE_LS_SOURCE,
            CFG_BLE_MAX_CONN_EVENT_LENGTH,
            CFG_BLE_HSE_STARTUP_TIME,
            CFG_BLE_VITERBI_MODE,
            CFG_BLE_OPTIONS,
            0U,                                 /* hw_version */
            CFG_BLE_MAX_COC_INITIATOR_NBR,
            CFG_BLE_MIN_TX_POWER,
            CFG_BLE_MAX_TX_POWER,
            CFG_BLE_RX_MODEL_CONFIG,
            CFG_BLE_MAX_ADV_SET_NBR,
            CFG_BLE_MAX_ADV_DATA_LEN,
            CFG_BLE_TX_PATH_COMPENS,
            CFG_BLE_RX_PATH_COMPENS,
            CFG_BLE_CORE_VERSION,
            CFG_BLE_OPTIONS_EXT,
            CFG_BLE_MAX_ADD_EATT_BEARERS,
        }
    };
    UART_Print("[BLE] SHCI_C2_BLE_Init...\r\n");
    SHCI_CmdStatus_t shci_status = SHCI_C2_BLE_Init(&ble_init);
    UART_Printf("[BLE] SHCI_C2_BLE_Init returned 0x%02X\r\n", (unsigned)shci_status);
    if (shci_status != SHCI_Success) {
        UART_Print("[BLE] ERROR: SHCI_C2_BLE_Init failed!\r\n");
        return;
    }

    /* ── Init GAP / GATT layers ───────────────────────────────────────────── */
    UART_Print("[BLE] GAP/GATT init...\r\n");
    _GapGattInit();

    /* ── Init service controller ──────────────────────────────────────────── */
    SVCCTL_Init();

