Akustik13/beacon-30mhz/TX_Beacon/STM32_WPAN/App/app_ble.c
    /* ── Register beacon GATT service ────────────────────────────────────── */
    UART_Print("[BLE] Beacon service init...\r\n");
    BLE_Beacon_Init();
    NUS_Init();

    /* ── Start advertising ────────────────────────────────────────────────── */
    UART_Print("[BLE] Starting advertising...\r\n");
    s_cpu2_initialized = 1U;
    _StartAdvertising();
    /* LED is managed by BLE_StartSession() — do NOT call LED_SetMode here */
}

/* ── BLE session management (Task 2) ─────────────────────────────────────── */

void BLE_StartSession(uint32_t timeout_ms)
{
    if (!BLE_IsIdle()) return;

    s_session_active     = 1U;
    s_session_is_timed   = (timeout_ms > 0U) ? 1U : 0U;
    s_session_timeout_ms = timeout_ms;
    s_session_start_tick = HAL_GetTick();

    UART_Printf("[BLE] StartSession timeout=%lu ms\r\n", timeout_ms);

    if (s_cpu2_initialized) {
        /* CPU2 BLE stack already running — restart advertising directly.
         * We cannot re-run BLE_AppInit() because once C2BOOT is set once,
         * TL_Enable()/LL_PWR_EnableBootC2() has no effect (hw_ipcc.c:210). */
        UART_Print("[BLE] CPU2 up — restart adv\r\n");
        _StartAdvertising();
    } else {
        BLE_SystemPreInit();
        BLE_AppInit();
    }

    /* BLE LED: if NORMAL mode, take over GPIO so main driver doesn't interfere */
    if (g_ble_led_mode == BLE_LED_NORMAL) {
        LED_SetBleOverride(1U);
        LED_WriteGpio(0U);
        s_adv_blink_tick  = HAL_GetTick();
        s_adv_blink_phase = 0U;
    }
    /* BLE_LED_OFF: override stays off — main LED driver runs normally throughout */
}

void BLE_StopSession(void)
{
    if (BLE_IsIdle()) return;
    UART_Print("[BLE] StopSession requested.\r\n");
    _StopSession_internal();
}

/* Shut down CPU2 completely — call before device Sleep/Shutdown or when BLE
 * mode changes to OFF.  Drains events, waits for CPU2 deep-sleep (max 500 ms),
 * then clears s_cpu2_initialized so the next BLE_StartSession() does full init. */
void BLE_ForceShutdown(void)
{
    if (!s_cpu2_initialized) return;

    /* Stop advertising if still active */
    if (s_ble_state != BLE_ST_IDLE) {
        aci_gap_set_non_discoverable();
        HAL_Delay(50U);
        s_ble_state        = BLE_ST_IDLE;
        s_session_active   = 0U;
        s_session_is_timed = 0U;
        LED_SetBleOverride(0U);
        BLE_Beacon_OnDisconnect();
        NUS_OnDisconnect();
    }

    LL_C2_PWR_SetPowerMode(LL_PWR_MODE_SHUTDOWN);
    {
        uint32_t _t0 = HAL_GetTick();
        for (uint8_t _p = 0U; _p < 5U; _p++) {
            uint32_t _rx = IPCC->C2TOC1SR & ~IPCC->C1MR & 0x3FU;
            if (_rx) HW_IPCC_Rx_Handler();
            if (s_hci_evt_pending)  { s_hci_evt_pending  = 0U; hci_user_evt_proc(); }
            if (s_shci_evt_pending) { s_shci_evt_pending = 0U; shci_user_evt_proc(); }
            HAL_Delay(10U);
        }
        while (!(READ_BIT(PWR->EXTSCR, PWR_EXTSCR_C2DS))) {
            if ((HAL_GetTick() - _t0) >= 500U) {
                UART_Print("[BLE] CPU2 slow to sleep\r\n");
                break;
            }
        }
    }
    s_cpu2_initialized = 0U;
    s_cpu2_ready       = 0U;
    s_shci_evt_pending = 0U;
    s_hci_evt_pending  = 0U;
    UART_Print("[BLE] CPU2 shut down.\r\n");
}

static void _StopSession_internal(void)
{
    /* Set Stop1 BEFORE stopping advertising so the mode register is already
     * set when CPU2 processes the stop command. This way any BLE LL timer
     * that fires after advertising stops (~64 ms "next slot" timer) still
     * uses Stop1 for WFI — CPU2 wakes briefly, processes the empty event,
     * then re-enters Stop1 automatically instead of staying in Run (440 µA).
     * Stop1 (not Shutdown) is intentional: CPU2 SRAM is retained and the
     * BLE stack resumes cleanly for the next session without TL_Enable(). */
    LL_C2_PWR_SetPowerMode(LL_PWR_MODE_STOP1);

    if (s_ble_state != BLE_ST_IDLE) {
        aci_gap_set_non_discoverable();
        /* Drain IPCC for up to 200 ms. After advertising stops, the BLE LL
         * sends a cleanup event ~64 ms later via IPCC. If CPU1 sleeps before
         * processing it, CPU2 waits on the occupied IPCC channel and stays in
         * Run (440 µA). Polling here lets CPU2 finish and enter Stop1. */
        uint32_t _t0 = HAL_GetTick();
        while ((HAL_GetTick() - _t0) < 200U) {
            uint32_t _rx = IPCC->C2TOC1SR & ~IPCC->C1MR & 0x3FU;
            if (_rx)               HW_IPCC_Rx_Handler();
            if (s_hci_evt_pending)  { s_hci_evt_pending  = 0U; hci_user_evt_proc();  }
            if (s_shci_evt_pending) { s_shci_evt_pending = 0U; shci_user_evt_proc(); }
            HAL_Delay(10U);
        }
    }

    s_ble_state        = BLE_ST_IDLE;
    s_shci_evt_pending = 0U;
    s_hci_evt_pending  = 0U;
    s_session_active   = 0U;
    s_session_is_timed = 0U;
    /* s_cpu2_ready and s_cpu2_initialized stay 1 — stack remains ready */

    LED_SetBleOverride(0U);
    BLE_Beacon_OnDisconnect();
    NUS_OnDisconnect();
    UART_Print("[BLE] Session ended (CPU2 stays ready).\r\n");
}

/* ── GAP / GATT init sequence ─────────────────────────────────────────────── */
static void _GapGattInit(void)
{
    uint8_t  bd_addr[6];
    uint16_t gap_svc_handle, gap_dev_name_handle, gap_appearance_handle;
    const uint8_t ir[16] = CFG_BLE_IR;
    const uint8_t er[16] = CFG_BLE_ER;
    char     name[CFG_GAP_DEVICE_NAME_LENGTH + 1U];

    hci_reset();
    HAL_Delay(300U);

    _BleGetBdAddress(bd_addr);
    s_uid_low = ((uint32_t)bd_addr[1] << 8U) | bd_addr[0];

    aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                              CONFIG_DATA_PUBADDR_LEN, bd_addr);
    aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET,
                              CONFIG_DATA_IR_LEN, ir);
    aci_hal_write_config_data(CONFIG_DATA_ER_OFFSET,
                              CONFIG_DATA_ER_LEN, er);

    /* TX power: use configurable g_ble_tx_power (Task 5) */
    aci_hal_set_tx_power_level(1, g_ble_tx_power);

    aci_gatt_init();

    /* Device name: manual or auto "BCN_XXXX" (Task 5) */
    if (g_ble_name_mode != 0U && g_ble_name[0] != '\0') {
        strncpy(name, g_ble_name, CFG_GAP_DEVICE_NAME_LENGTH);
        name[CFG_GAP_DEVICE_NAME_LENGTH] = '\0';
    } else {
        (void)snprintf(name, sizeof(name), "BCN_%04lX",
                       (unsigned long)(s_uid_low & 0xFFFFUL));
    }

    s_adv_local_name[0] = AD_TYPE_COMPLETE_LOCAL_NAME;
    memcpy(&s_adv_local_name[1], name, CFG_GAP_DEVICE_NAME_LENGTH);

    aci_gap_init(GAP_PERIPHERAL_ROLE, PRIVACY_DISABLED,
                 (uint8_t)strlen(name),
                 &gap_svc_handle, &gap_dev_name_handle, &gap_appearance_handle);

    aci_gatt_update_char_value(gap_svc_handle, gap_dev_name_handle,
                               0U, (uint8_t)strlen(name), (uint8_t*)name);

    aci_gap_set_io_capability(CFG_IO_CAPABILITY);
    aci_gap_set_authentication_requirement(CFG_BONDING_MODE,
                                           CFG_MITM_PROTECTION,
                                           CFG_SC_SUPPORT,
                                           CFG_KEYPRESS_NOTIFICATION_SUPPORT,
                                           CFG_ENCRYPTION_KEY_SIZE_MIN,
                                           CFG_ENCRYPTION_KEY_SIZE_MAX,
                                           CFG_USED_FIXED_PIN,
                                           CFG_FIXED_PIN,
                                           GAP_PUBLIC_ADDR);

    UART_Printf("[BLE] Stack ready. Name=\"%s\" UID=0x%08lX\r\n",
                name, (unsigned long)LL_FLASH_GetUDN());
}

/* ── Advertising ──────────────────────────────────────────────────────────── */
static void _StartAdvertising(void)
{
    /* Advertising interval: configurable via g_ble_adv_interval_ms (Task 5).
     * BLE unit = 0.625 ms → units = ms * 8 / 5.  Clamp to [100ms, 10s]. */
    uint32_t adv_ms = g_ble_adv_interval_ms;
    if (adv_ms < 100U)   adv_ms = 100U;
    if (adv_ms > 10000U) adv_ms = 10000U;
    uint16_t adv_units = (uint16_t)(adv_ms * 8U / 5U);

    tBleStatus ret = aci_gap_set_discoverable(ADV_IND,
                                              adv_units, adv_units,
                                              GAP_PUBLIC_ADDR,
                                              NO_WHITE_LIST_USE,
                                              0U, NULL,
                                              0U, NULL,
                                              0U, 0U);
    if (ret != BLE_STATUS_SUCCESS) {
        UART_Printf("[BLE] set_discoverable err 0x%02X\r\n", ret);
        s_ble_state = BLE_ST_IDLE;
        return;
    }

