Akustik13/beacon-30mhz/TX_Beacon/STM32_WPAN/App/app_ble.c
    aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);

    /* Write device name into ADV payload explicitly (unreliable via param on WB1M) */
    uint8_t adv_data[2U + CFG_GAP_DEVICE_NAME_LENGTH];
    adv_data[0] = (uint8_t)(1U + CFG_GAP_DEVICE_NAME_LENGTH);
    memcpy(&adv_data[1], s_adv_local_name, sizeof(s_adv_local_name));
    tBleStatus adv_ret = aci_gap_update_adv_data(sizeof(adv_data), adv_data);
    if (adv_ret != BLE_STATUS_SUCCESS) {
        UART_Printf("[BLE] update_adv_data err 0x%02X\r\n", adv_ret);
        s_ble_state = BLE_ST_IDLE;
        return;
    }

    UART_Printf("[BLE] Advertising started (interval=%lu ms)\r\n", adv_ms);
    s_ble_state = BLE_ST_ADV;
}

/* Handle link-state events directly at HCI ingress — avoids SVCCTL routing
 * dependency for reconnect advertising. */
static void _HandleConnectionEvent(void *pPayload)
{
    hci_event_pckt *event_pckt =
        (hci_event_pckt*)((hci_uart_pckt*)pPayload)->data;

    switch (event_pckt->evt) {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE: {
        s_conn_handle = 0xFFFFU;
        s_ble_state   = BLE_ST_IDLE;
        BLE_Beacon_OnDisconnect();
        NUS_OnDisconnect();
        UART_Print("[BLE] Client disconnected.\r\n");

        if (g_ble_op_mode & BLE_OP_CONTINUOUS) {
            /* Continuous mode: always restart advertising on disconnect */
            _StartAdvertising();
            if (g_ble_led_mode == BLE_LED_NORMAL) {
                LED_SetBleOverride(1U);     /* re-take LED for adv blink */
                s_adv_blink_tick  = HAL_GetTick();
                s_adv_blink_phase = 0U;
            }
        } else {
            /* Schedule / Gekon: end session after disconnect */
            _StopSession_internal();
        }
        break;
    }
    case HCI_LE_META_EVT_CODE: {
        evt_le_meta_event *meta = (evt_le_meta_event*)event_pckt->data;
        if (meta->subevent == HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE) {
            hci_le_connection_complete_event_rp0 *cc =
                (hci_le_connection_complete_event_rp0*)meta->data;
            s_conn_handle       = cc->Connection_Handle;
            s_ble_state         = BLE_ST_CONN;
            s_nus_last_rx_tick  = HAL_GetTick();  /* start inactivity watchdog */
            UART_Print("[BLE] Client connected.\r\n");
            if (g_ble_led_mode == BLE_LED_NORMAL) {
                LED_Blink(3U, 80U, 80U);
                LED_SetBleOverride(0U);     /* release — let main LED run during connection */
                LED_SetMode(LED_GetMode()); /* re-init mode state machine */
            }
        }
        break;
    }
    default:
        break;
    }
}

/* Retained for SVCCTL compatibility; link-state handling occurs in
 * _HandleConnectionEvent() called from _BleUserEvtRx(). */
SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
{
    (void)pckt;
    return SVCCTL_UserEvtFlowEnable;
}

/* ── HCI / SHCI user callbacks ────────────────────────────────────────────── */

static void _BleUserEvtRx(void *pPayload)
{
    tHCI_UserEvtRxParam *param = (tHCI_UserEvtRxParam*)pPayload;
    void *evtserial = (void*)&param->pckt->evtserial;

    /* Handle connection events before routing to SVCCTL */
    _HandleConnectionEvent(evtserial);
    SVCCTL_UserEvtFlowStatus_t flow = SVCCTL_UserEvtRx(evtserial);
    param->status = (flow == SVCCTL_UserEvtFlowDisable)
                  ? HCI_TL_UserEventFlow_Disable
                  : HCI_TL_UserEventFlow_Enable;
}

static void _BleStatusNot(HCI_TL_CmdStatus_t status)
{
    (void)status;
}

static void _SysEvtHandler(void *pPayload)
{
    TL_AsynchEvt_t *p_evt =
        (TL_AsynchEvt_t*)(((tSHCI_UserEvtRxParam*)pPayload)->pckt->evtserial.evt.payload);

    if (p_evt->subevtcode == SHCI_SUB_EVT_CODE_READY)
        s_cpu2_ready = 1U;
}

static void _SysStatusNot(SHCI_TL_CmdStatus_t status)
{
    (void)status;
}

/* Called from IRQ (IPCC Rx) when a BLE async event is ready */
void hci_notify_asynch_evt(void *pdata)
{
    (void)pdata;
    s_hci_notify_count++;
    s_hci_evt_pending = 1U;
}

/* Called from IRQ when a SHCI async event is ready */
void shci_notify_asynch_evt(void *pdata)
{
    (void)pdata;
    s_shci_evt_pending = 1U;
}

/* HCI command response sync primitives */
void hci_cmd_resp_wait(uint32_t timeout)
{
    UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
    (void)timeout;
}

void hci_cmd_resp_release(uint32_t flag)
{
    (void)flag;
    UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
}

/* SHCI command response sync primitives */
void shci_cmd_resp_wait(uint32_t timeout)
{
    UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_SYSTEM_HCI_CMD_EVT_RSP_ID);
    (void)timeout;
}

void shci_cmd_resp_release(uint32_t flag)
{
    (void)flag;
    UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_SYSTEM_HCI_CMD_EVT_RSP_ID);
}

/* UTIL_SEQ idle — no-op: TX_Beacon manages its own power in svc_power.c */
void UTIL_SEQ_Idle(void) {}

/* ── BD address derivation from MCU UID ───────────────────────────────────── */
static void _BleGetBdAddress(uint8_t *pbd_addr)
{
    const uint32_t udn = LL_FLASH_GetUDN();

    if (udn != 0xFFFFFFFFUL) {
        const uint32_t company = LL_FLASH_GetSTCompanyID();
        const uint32_t devid   = LL_FLASH_GetDeviceID();

        pbd_addr[0] = (uint8_t)(udn          & 0xFFU);
        pbd_addr[1] = (uint8_t)((udn >> 8U)  & 0xFFU);
        pbd_addr[2] = (uint8_t)((udn >> 16U) & 0xFFU);
        pbd_addr[3] = (uint8_t)(company       & 0xFFU);
        pbd_addr[4] = (uint8_t)((devid >> 8U) & 0xFFU);
        pbd_addr[5] = (uint8_t)((devid        & 0xFFU) | 0xC0U);
    } else {
        pbd_addr[0] = 0x00U;
        pbd_addr[1] = 0x00U;
        pbd_addr[2] = 0x00U;
        pbd_addr[3] = 0xAAU;
        pbd_addr[4] = 0xBBU;
        pbd_addr[5] = 0xCCU;
    }
}

/* ── BLE LED non-blocking state machine ──────────────────────────────────── */
void BLE_LED_Update(void)
{
    if (g_ble_led_mode != BLE_LED_NORMAL) return;  /* BLE_LED_OFF: main driver runs */
    if (s_ble_state != BLE_ST_ADV) return;          /* only during advertising */

    uint32_t now    = HAL_GetTick();
    uint32_t period = (g_ble_adv_interval_ms >= 100U) ? g_ble_adv_interval_ms : 1000U;

    if (s_adv_blink_phase == 0U) {
        /* waiting for next blink */
        if ((now - s_adv_blink_tick) >= period) {
            LED_WriteGpio(1U);
            s_adv_blink_tick  = now;
            s_adv_blink_phase = 1U;
        }
    } else {
        /* pulse is on — turn off after 50 ms */
        if ((now - s_adv_blink_tick) >= 50U) {
            LED_WriteGpio(0U);
            s_adv_blink_tick  = now;
            s_adv_blink_phase = 0U;
        }
    }
}
